xl0/nRF51822-Movuino/arduino-1.6.x/hardware/Movuino/Movuino_nRF51822/boards.txt

Movuino_099_6.name=Movuino 0.99.6

Movuino_099_6.upload.tool=avrdude
Movuino_099_6.upload.protocol=avr109
Movuino_099_6.upload.maximum_size=196608
Movuino_099_6.upload.maximum_data_size=2560
Movuino_099_6.upload.speed=115200
Movuino_099_6.upload.disable_flushing=true
Movuino_099_6.upload.use_1200bps_touch=true
Movuino_099_6.upload.wait_for_upload_port=false

Movuino_099_6.tool.avrdude.path={runtime.tools.avrdude.path};
Movuino_099_6.build.mcu=cortex-m0
Movuino_099_6.build.f_cpu=16000000
Movuino_099_6.build.usb_product="Arduino RBL"
Movuino_099_6.build.board=Movuino
Movuino_099_6.build.core=RBL_nRF51822
Movuino_099_6.build.variant=Movuino_099_6
Movuino_099_6.build.extra_flags=-mthumb
Movuino_099_6.build.ldscript=linker_scripts/gcc/RBL_nRF51822.ld
Movuino_099_6.build.ble_api_include="-I{runtime.hardware.path}/Movuino_nRF51822/cores/RBL_nRF51822/BLE_API-master" "-I{runtime.hardware.path}/Movuino_nRF51822/cores/RBL_nRF51822/BLE_API-master/ble/services" "-I{runtime.hardware.path}/Movuino_nRF51822/cores/RBL_nRF51822/BLE_API-master/source" "-I{runtime.hardware.path}/Movuino_nRF51822/cores/RBL_nRF51822/BLE_API-master/source/services" 
Movuino_099_6.build.nRF51822_api_include="-I{runtime.hardware.path}/Movuino_nRF51822/cores/RBL_nRF51822/nRF51822-master/source" "-I{runtime.hardware.path}/Movuino_nRF51822/cores/RBL_nRF51822/nRF51822-master/source/btle" "-I{runtime.hardware.path}/Movuino_nRF51822/cores/RBL_nRF51822/nRF51822-master/source/btle/custom" "-I{runtime.hardware.path}/Movuino_nRF51822/cores/RBL_nRF51822/nRF51822-master/source/common" "-I{runtime.hardware.path}/Movuino_nRF51822/cores/RBL_nRF51822/nRF51822-master/source/nordic-sdk/components/ble/ble_radio_notification" "-I{runtime.hardware.path}/Movuino_nRF51822/cores/RBL_nRF51822/nRF51822-master/source/nordic-sdk/components/ble/ble_services/ble_dfu" "-I{runtime.hardware.path}/Movuino_nRF51822/cores/RBL_nRF51822/nRF51822-master/source/nordic-sdk/components/ble/common" "-I{runtime.hardware.path}/Movuino_nRF51822/cores/RBL_nRF51822/nRF51822-master/source/nordic-sdk/components/ble/device_manager" "-I{runtime.hardware.path}/Movuino_nRF51822/cores/RBL_nRF51822/nRF51822-master/source/nordic-sdk/components/ble/device_manager/config" "-I{runtime.hardware.path}/Movuino_nRF51822/cores/RBL_nRF51822/nRF51822-master/source/nordic-sdk/components/drivers_nrf/ble_flash" "-I{runtime.hardware.path}/Movuino_nRF51822/cores/RBL_nRF51822/nRF51822-master/source/nordic-sdk/components/drivers_nrf/hal" "-I{runtime.hardware.path}/Movuino_nRF51822/cores/RBL_nRF51822/nRF51822-master/source/nordic-sdk/components/drivers_nrf/pstorage" "-I{runtime.hardware.path}/Movuino_nRF51822/cores/RBL_nRF51822/nRF51822-master/source/nordic-sdk/components/drivers_nrf/pstorage/config" "-I{runtime.hardware.path}/Movuino_nRF51822/cores/RBL_nRF51822/nRF51822-master/source/nordic-sdk/components/libraries/bootloader_dfu" "-I{runtime.hardware.path}/Movuino_nRF51822/cores/RBL_nRF51822/nRF51822-master/source/nordic-sdk/components/libraries/bootloader_dfu/experimental" "-I{runtime.hardware.path}/Movuino_nRF51822/cores/RBL_nRF51822/nRF51822-master/source/nordic-sdk/components/libraries/bootloader_dfu/hci_transport" "-I{runtime.hardware.path}/Movuino_nRF51822/cores/RBL_nRF51822/nRF51822-master/source/nordic-sdk/components/libraries/crc16" "-I{runtime.hardware.path}/Movuino_nRF51822/cores/RBL_nRF51822/nRF51822-master/source/nordic-sdk/components/libraries/hci" "-I{runtime.hardware.path}/Movuino_nRF51822/cores/RBL_nRF51822/nRF51822-master/source/nordic-sdk/components/libraries/scheduler" "-I{runtime.hardware.path}/Movuino_nRF51822/cores/RBL_nRF51822/nRF51822-master/source/nordic-sdk/components/libraries/util" "-I{runtime.hardware.path}/Movuino_nRF51822/cores/RBL_nRF51822/nRF51822-master/source/nordic-sdk/components/softdevice/common/softdevice_handler" "-I{runtime.hardware.path}/Movuino_nRF51822/cores/RBL_nRF51822/nRF51822-master/source/nordic-sdk/components/softdevice/s130/include"     
Movuino_099_6.build.mbed_api_include="-I{runtime.hardware.path}/Movuino_nRF51822/cores/RBL_nRF51822/mbed/api" "-I{runtime.hardware.path}/Movuino_nRF51822/cores/RBL_nRF51822/mbed/common" "-I{runtime.hardware.path}/Movuino_nRF51822/cores/RBL_nRF51822/mbed/hal" "-I{runtime.hardware.path}/Movuino_nRF51822/cores/RBL_nRF51822/mbed/targets/cmsis" "-I{runtime.hardware.path}/Movuino_nRF51822/cores/RBL_nRF51822/mbed/targets/cmsis/TARGET_NORDIC/TARGET_MCU_NRF51822/" "-I{runtime.hardware.path}/Movuino_nRF51822/cores/RBL_nRF51822/mbed/targets/cmsis/TARGET_NORDIC/TARGET_MCU_NRF51822/TOOLCHAIN_GCC_ARM" "-I{runtime.hardware.path}/Movuino_nRF51822/cores/RBL_nRF51822/mbed/targets/cmsis/TARGET_NORDIC/TARGET_MCU_NRF51822/TOOLCHAIN_GCC_ARM/TARGET_MCU_NORDIC_16K" "-I{runtime.hardware.path}/Movuino_nRF51822/cores/RBL_nRF51822/mbed/targets/cmsis/TARGET_NORDIC/TARGET_MCU_NRF51822/TOOLCHAIN_GCC_ARM/TARGET_MCU_NORDIC_32K" "-I{runtime.hardware.path}/Movuino_nRF51822/cores/RBL_nRF51822/mbed/targets/hal/TARGET_NORDIC/TARGET_MCU_NRF51822" "-I{runtime.hardware.path}/Movuino_nRF51822/cores/RBL_nRF51822/mbed/targets/hal/TARGET_NORDIC/TARGET_MCU_NRF51822/Lib/nordic_sdk/components/libraries/crc16" "-I{runtime.hardware.path}/Movuino_nRF51822/cores/RBL_nRF51822/mbed/targets/hal/TARGET_NORDIC/TARGET_MCU_NRF51822/Lib/nordic_sdk/components/libraries/scheduler" "-I{runtime.hardware.path}/Movuino_nRF51822/cores/RBL_nRF51822/mbed/targets/hal/TARGET_NORDIC/TARGET_MCU_NRF51822/Lib/nordic_sdk/components/libraries/util" "-I{runtime.hardware.path}/Movuino_nRF51822/cores/RBL_nRF51822/mbed/targets/hal/TARGET_NORDIC/TARGET_MCU_NRF51822/TARGET_RBLAB_NRF51822"
